# DeltaDegreeC Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..DeltaDegreeC Property
SymbolTypeId Class See Also
---
Symbol delta°C, indicating unit Celsius interval.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId DeltaDegreeC { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DeltaDegreeC As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DeltaDegreeC {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace